Revit 2016 API
PreviewFamilyVisibilityMode Enumeration
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public enum PreviewFamilyVisibilityMode
Visual Basic
Public Enumeration PreviewFamilyVisibilityMode
Visual C++
public enum class PreviewFamilyVisibilityMode
Members
Member name | Description
Off |  Element Visibility is not applied. All family elements visible.
On |  Element Visibility of a view is applied to show visible elements only. Elements that are cut by a reference plane will be shown with their respective cut geometry.
Uncut |  Element Visibility of a view is applied to show elements visible if instance is not cut. Note that this state is only available in certain views, such as floor plan and ceilings.
See Also
Autodesk.Revit.DB Namespace